{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[BOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "String": "+"
        },
        "behavior": "Removed",
        "invert": false
      },
      {
        "type": "Split",
        "pattern": {
          "String": "|"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "Split",
        "pattern": {
          "String": "\n"
        },
        "behavior": "Removed",
        "invert": false
      }
    ]
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "WordLevel",
    "vocab": {
      "[PAD]": 0,
      "[BOS]": 1,
      "[EOS]": 2,
      "+": 3,
      "|": 4,
      "barline": 5,
      "clef-C1": 6,
      "clef-C2": 7,
      "clef-C3": 8,
      "clef-C4": 9,
      "clef-C5": 10,
      "clef-F3": 11,
      "clef-F4": 12,
      "clef-F5": 13,
      "clef-G1": 14,
      "clef-G2": 15,
      "keySignature-AM": 16,
      "keySignature-AbM": 17,
      "keySignature-BM": 18,
      "keySignature-BbM": 19,
      "keySignature-C#M": 20,
      "keySignature-CM": 21,
      "keySignature-CbM": 22,
      "keySignature-DM": 23,
      "keySignature-DbM": 24,
      "keySignature-EM": 25,
      "keySignature-EbM": 26,
      "keySignature-F#M": 27,
      "keySignature-FM": 28,
      "keySignature-GM": 29,
      "keySignature-GbM": 30,
      "multirest": 31,
      "note-breve": 32,
      "note-breve.": 33,
      "note-eighth": 34,
      "note-eighth.": 35,
      "note-half": 36,
      "note-half.": 37,
      "note-hundred_twenty_eighth": 38,
      "note-long": 39,
      "note-quarter": 40,
      "note-quarter.": 41,
      "note-sixteenth": 42,
      "note-sixteenth.": 43,
      "note-sixty_fourth": 44,
      "note-sixty_fourth.": 45,
      "note-thirty_second": 46,
      "note-thirty_second.": 47,
      "note-whole": 48,
      "note-whole.": 49,
      "rest-256th": 50,
      "rest-512th": 51,
      "rest-breve": 52,
      "rest-eighth": 53,
      "rest-eighth.": 54,
      "rest-half": 55,
      "rest-half.": 56,
      "rest-hundred_twenty_eighth": 57,
      "rest-long": 58,
      "rest-quarter": 59,
      "rest-quarter.": 60,
      "rest-sixteenth": 61,
      "rest-sixteenth.": 62,
      "rest-sixty_fourth": 63,
      "rest-sixty_fourth.": 64,
      "rest-thirty_second": 65,
      "rest-thirty_second.": 66,
      "rest-whole": 67,
      "rest-whole.": 68,
      "timeSignature": 69
    },
    "unk_token": "<unk>"
  }
}
